In [1]:
import pandas as pd

In [2]:
asian = pd.read_csv('Resources/asian.csv')
black = pd.read_csv('Resources/black.csv')
white = pd.read_csv('Resources/black.csv')

In [3]:
#combine first two race based dataframes to ensure merge is working
race_df = pd.concat([asian, black], ignore_index=True)

In [4]:
race_df.head()

       DATE  ASIAN  BLACK
0  1/1/2003    5.5    NaN
1  2/1/2003    5.8    NaN
2  3/1/2003    6.5    NaN
3  4/1/2003    6.0    NaN
4  5/1/2003    5.5    NaN

In [5]:
#combine the final dataframe with the new one
race = pd.merge(race_df, white, on='DATE', how='outer')
race.head()

       DATE  ASIAN  BLACK_x  BLACK_y
0  1/1/2003    5.5      NaN     10.5
1  1/1/2003    NaN     10.5     10.5
2  2/1/2003    5.8      NaN     10.7
3  2/1/2003    NaN     10.7     10.7
4  3/1/2003    6.5      NaN     10.3